//////////////////////////////////////////////////////////////////////////////////////////
// Effect.h
//------------------------------------------------------------------------------------------
// 作成者：柳沢帆貴
//------------------------------------------------------------------------------------------
// エフェクトに関すること
//------------------------------------------------------------------------------------------
// 2020/08/08	作成
// 
//				
//
///////////////////////////////////////////////////////////////////////////////////////////
#pragma once
#include "Anime.h"

#define MAX_EFFECT (2)

enum FX_KIND
{
	EXPLOSION,
	FIRE,

	MAX_FX
};

class Effect : public CAnime
{
public:
	Effect() {};
	Effect(FX_KIND kind, float x, float y);

	~Effect();

	static void Init();
	static void Uninit();
	void Update();
	void Draw();

private:
	VECTOR2<> m_Pos;

	static CTexture m_Texture[MAX_EFFECT];
};


