////////////////////////////////////////////////////////////////////////////////////////////
// HierarchyState.h
//----------------------------------------------------------------------------------------
// 作成者：柳沢 帆貴
//----------------------------------------------------------------------------------------
// Stateを管理しやすくするため階層ごとに分ける
//-----------------------------------------------------------------------------------------
// 2020/08/07	作成
//				
//
///////////////////////////////////////////////////////////////////////////////////////////


#pragma once

#define DISTANCE (250.0f)

class CEnemy;
class State;

// 階層用基底状態　　　抽象クラス
class HierarchyState
{
public:
	virtual ~HierarchyState() {}

	virtual void Init       (CEnemy *)          = 0;
	virtual void Update     (CEnemy *)          = 0;
	virtual void ChangeState(CEnemy *, State *) = 0;

protected:
};