////////////////////////////////////////////////////////////////////////////////////////////
// WaitState.cpp
//----------------------------------------------------------------------------------------
// ì¬ŽÒF–ö‘ò ”¿‹M
//----------------------------------------------------------------------------------------
// ‘Ò‹@ó‘Ô‚ÉŠÖ‚·‚é‚±‚Æ
//-----------------------------------------------------------------------------------------
// 2020/08/07	ì¬
//				
//
///////////////////////////////////////////////////////////////////////////////////////////
#include "WaitState.h"
#include "MoveState.h"
#include "Enemy.h"
#include "HierarchyState.h"


void WaitState::Init(CEnemy *enemy)
{
}

void WaitState::Update(CEnemy *enemy, HierarchyState *parent)
{
	int time = enemy->AddTime(1);
	
	if (time > 30)
	{
		parent->ChangeState(enemy, MoveState::GetInstance());
	}
}
